Revit 2026 API
RevitLinkUIUtils Class
 A class containing functions for displaying user interface related to Revit links.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.UI.RevitLinkUIUtils
Namespace: Autodesk.Revit.UI
Assembly: RevitAPIUI (in RevitAPIUI.dll) Version: 26.0.4.0 (26.0.4.0)
Syntax
public static class RevitLinkUIUtils
Public NotInheritable Class RevitLinkUIUtils
public ref class RevitLinkUIUtils abstract sealed
[<AbstractClassAttribute>]
[<SealedAttribute>]
type RevitLinkUIUtils = class end
The RevitLinkUIUtils type exposes the following members.
Methods
Name | Description
ReportLinkLoadResults
Top
See Also
Reference
Autodesk.Revit.UI Namespace